#Definição do Clock
#==============================================================================
create_clock -name sys_clk -period 20.0 [get_ports clk]
#==============================================================================

#Caracteristicas de Clock
#==============================================================================
set_clock_uncertainty 0.5 [get_clocks sys_clk]
#==============================================================================

#Restrições de Entradas
#==============================================================================
set_input_delay -clock sys_clk -max 3.0 [all_inputs]
#==============================================================================

#Restrições de Saída
#==============================================================================
set_input_delay -clock sys_clk -max 3.0 [all_inputs]
#==============================================================================
