#Vending.sdc - Restrições de temporização pata o design Vending Machine Controller
#Autores: Valmir F. Silva, Marcos A. I Luz
#Data: 17/07/2026

#==============================================================================
#Definição do Clock
#==============================================================================
create_clock -name sys_clk -period 20.0 [get_ports clk]
#==============================================================================

#Caracteristicas de Clock
#==============================================================================
set_clock_uncertainty 0.5 [get_clocks sys_clk]
#==============================================================================

#Restrições de Entradas
#==============================================================================
set_input_delay -clock sys_clk -max 3.0 [all_inputs]
#==============================================================================

#Restrições de Saída
#==============================================================================
set_output_delay -clock sys_clk -max 3.0 [all_outputs]
#==============================================================================
